Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/financial_services/financial_products/financial_regulator.html.txt.tmx
Source language: en
Languages: ga

source: The Central Bank of Ireland is responsible for the regulation of all financial services firms in Ireland
ga: Tá Banc Ceannais na hÉireann freagrach as rialachán ghnólachtaí sheirbhís airgeadais in Éirinn

source: The Central Bank Reform Act 2010, which commenced on 1 October 2010, created a new single body called the Central Bank of Ireland which is responsible for both central banking and financial regulation
ga: Cruthaigh an tAcht um Athchóiriú an Bhainc Cheannais 2010, a thosaigh ar 1 Deireadh Fómhair 2010, comhlacht aonair nua ar a dtugtar Banc Ceannais na hÉireann atá freagrach as baincéireacht cheannais agus rialachán airgeadais

source: It replaced the previous related bodies – the Central Bank and the Financial Services Authority of Ireland (generally known as the Central Bank) and the Irish Financial Services Regulatory Authority (Financial Regulator)
ga: Ghlac sé ionad na gcomhlachtaí bainteacha roimhe seo– Banc Ceannais agus Údarás Seirbhísí Airgeadais na hÉireann (ar a dtugtar an Banc Ceannais go ginearálta) and Údarás Rialála Seirbhísí Airgeadais na hÉireann (Rialtóir Airgeadais)

source: What does the Central Bank of Ireland regulate?
ga: Céard a rialaíonn Banc Ceannais na hÉireann?

source: The Central Bank regulates the activities of:
ga: Rialaíonn an Banc Ceannais gníomhaíochtaí na ndreamanna seo a leanas:

source: • Credit institutions, investment intermediaries, stockbrokers, financial exchanges, collective investment schemes, funds, investor compensation and related consumer issues
ga: • Institiúidí Creidmheasa, idirghabhálaithe infheistíochta, stocbhróicéirí, malartáin airgeadais, scéimeanna comhinfheistíochta, cistí, cúiteamh infheisteora agus saincheisteanna gaolmhara um thomhaltóirí

source: • Life insurance, general insurance and related consumer issues
ga: • Árachas saoil, árachas ginearálta agus saincheisteanna gaolmhara um thomhaltóirí

source: • Moneylenders, mortgage and credit intermediaries, the monitoring of customer charges by credit institutions and related consumer issues
ga: • Iasachtóirí Airgid, idirghabhálaithe morgáiste agus creidmheasa, monatóireacht ar mhuirir chustaiméirí a ghearrann na hinstitiúidí creidmheasa agus saincheisteanna gaolmhara um thomhaltóirí

source: You can find more information on the financial institutions regulated here
ga: Is féidir leat tuilleadh eolais a fháil ar na hinstitiúidí airgeadais atá rialaithe anseo

source: What is the main purpose of regulation?
ga: Cad é an príomhchuspóir atá ag rialúchán?

source: The main purpose of regulation is:
ga: Is é an príomhchuspóir atá ag rialúchán:

source: • To promote a safe and fair financial services market for consumers
ga: • Margadh sheirbhís airgeadais cothrom sábháilte do thomhaltóirí a chur chun cinn

source: • To promote sound and solvent financial institutions, thereby giving depositors and other consumers of financial products confidence that their deposits and investments are safe
ga: • Institiúidí slána sócmhainneacha airgeadais a chur chun cinn, agus muinín a thabhairt dá réir do thaisceoirí agus tomhaltóirí eile na dtáirgí airgeadais go mbeidh a gcuid infheistíochtaí sábháilte

source: The Central Bank monitors and enforces the consumer protection, conduct of business and prudential requirements of financial institutions
ga: Déanann an Banc Ceannais monatóireacht agus feidhmiú ar chosaint tomhaltóirí, iompar gnó agus riachtanais stuamachta institiúidí airgeadais

source: It also sets minimum competency requirements for firms
ga: Leagann sé síos riachtanais inniúlachta íosmhéid do chomhlachtaí

source: What is a code of conduct?
ga: Cad is cód iompair ann?

source: The Central Bank has a number of statutory codes of conduct which oblige financial institutions to act in a fair and transparent manner, and in the best interests of their customers
ga: Tá roinnt cóid iompair reachtúla ag an mBanc Ceannais a chuireann oibleagáid ar institiúidí airgid a ghníomhú ar bhealach cothrom trédhearcach, agus ar mhaithe lena gcuid custaiméirí

source: These protection codes are policed and enforced by means of on-site inspections, backed-up by enforcement powers
ga: Déanfar na cóid chosanta seo a phóilíniú agus a fhorfheidhmiú trí iniúchtaí ar an láthair a dhéanamh, le tacaíocht ó chumhachtaí forfheidhmithe

source: Copies of the various codes are available on the Central Bank’s financial regulation website
ga: Tá cóipeanna de na cóid éagsúla ar fáil ar láithreán gréasáin rialachán airgeadais an Bhainc Cheannais

source: Where do I make a complaint about a financial institution?
ga: Cá ndéanaim gearán faoi institiúid airgeadais?

source: It is important that you first make your complaint to your financial service provider
ga: Tá sé tábhachtach go ndéanann tú do ghearán i dtosach le do sholáthraí seirbhíse airgeadais

source: It is best to put your complaint to your provider in writing and keep a copy of your letter
ga: Is fearr do ghearán a dhéanamh le do sholáthraí i scríbhinn agus cóip de do litir a choimeád

source: You must give your provider an opportunity to look into your problem and allow them to try to reach a resolution
ga: Ní mór duit an deis a thabhairt do do sholáthraí chun súil a chaitheamh ar d’fhadhb agus ligean dóibh iarracht a dhéanamh chun réiteach a bhaint amach

source: If you are still not satisfied that your complaint is being dealt with fairly by your provider, you may take your complaint to the Financial Services Ombudsman
ga: Mura bhfuil tú sásta go fóill go bhfuil do ghearán á láimhseáil go cóir ag an ngnólacht, is féidir leat do ghearán a chur chuig an Ombudsman um Sheirbhísí Airgeadais

source: You can read more about making a complaint in our document: Making a complaint about a financial service provider
ga: Is féidir leat tuilleadh a léamh faoi ghearán a dhéanamh in ár gcáipéis: Gearán a dhéanamh faoi sholáthróir sheirbhís airgeadais

source: Where can I find information on financial products?
ga: Cén áit inar féidir liom eolas a fháil faoi tháirgí airgeadais?

source: The Competition and Consumer Protection Commission (CCPC) provides information to consumers on their rights and on the costs, risks and benefits of different financial products
ga: Cuireann an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) eolas ar fáil do thomhaltóirí maidir leis na cearta agus ar na costais, rioscaí agus na buntáistí a bhaineann le táirgí airgeadais éagsúla

source: This information also helps you to access the financial services that are most suitable to you
ga: Cabhraíonn an t-eolas leat rochtain a fháil ar na seirbhísí airgeadais is fearr a oireann duit

source: The CCPC maintains financial information on its website for consumers
ga: Coinníonn an CCPC láithreán gréasáin airgeadais do thomhaltóirí
